In [98]:
import numpy as np
import pandas as pd

In [99]:
mydataset = {
  'cars': ["BMW", "Volvo", "Ford"],
  'passings': [3, 7, 2]
}

myvar = pd.DataFrame(mydataset)

print(myvar)

    cars  passings
0    BMW         3
1  Volvo         7
2   Ford         2

In [100]:
x=np.array([1,2,3,4,5])
y=np.array([2,4,6,8,10])
myv= pd.DataFrame({'xx':x,'yy':y})
print(myv)

   xx  yy
0   1   2
1   2   4
2   3   6
3   4   8
4   5  10

In [101]:
a = [1, 7, 2]

myvar1 = pd.Series(a)

print(myvar1)

0    1
1    7
2    2
dtype: int64

In [102]:
a = [1, 7, 2]
myvar = pd.Series(a, index = ["x", "y", "z"])
print(myvar)

x    1
y    7
z    2
dtype: int64

In [103]:
s=np.array([1,2,3,4,5,6,7,8,9,10])
my=pd.Series({"s":s})
print(my)

s    [1, 2, 3, 4, 5, 6, 7, 8, 9, 10]
dtype: object

In [104]:
s=np.array([3,6,9,12,15,18,21,24,27,30])
s1=np.array([2,4,6,8,10,12,14,16,18,20])
my=pd.DataFrame({"s1":s1,"s":s})
print(my)

   s1   s
0   2   3
1   4   6
2   6   9
3   8  12
4  10  15
5  12  18
6  14  21
7  16  24
8  18  27
9  20  30

In [105]:
info={
    "name": ["John", "Mary", "Peter", "Jeff", "Bill", "Lisa", "Joseph"],
    "age": [23, 78, 22, 19, 45, 33, 20],
    "city": ["London", "New York", "London", "Paris", "London", "New York", "London"],
    "marks": [60, 90, 70, 50, 87, 79, 90]
}
infosub=pd.DataFrame(info)
infosub

     name  age      city  marks
0    John   23    London     60
1    Mary   78  New York     90
2   Peter   22    London     70
3    Jeff   19     Paris     50
4    Bill   45    London     87
5    Lisa   33  New York     79
6  Joseph   20    London     90

In [106]:
infosub.to_csv('infosub.csv', index=False)

In [107]:
infosub.head(3)

    name  age      city  marks
0   John   23    London     60
1   Mary   78  New York     90
2  Peter   22    London     70

In [108]:
infosub.tail(4)

     name  age      city  marks
3    Jeff   19     Paris     50
4    Bill   45    London     87
5    Lisa   33  New York     79
6  Joseph   20    London     90

In [109]:
infosub.sample(4)

     name  age    city  marks
4    Bill   45  London     87
0    John   23  London     60
6  Joseph   20  London     90
3    Jeff   19   Paris     50

In [110]:
infosub.describe()

             age      marks
count   7.000000   7.000000
mean   34.285714  75.142857
std    21.383126  15.731376
min    19.000000  50.000000
25%    21.000000  65.000000
50%    23.000000  79.000000
75%    39.000000  88.500000
max    78.000000  90.000000

In [111]:
infosub[['marks','city']]

   marks      city
0     60    London
1     90  New York
2     70    London
3     50     Paris
4     87    London
5     79  New York
6     90    London

In [112]:
infosub['marks'][0]=100

C:\Users\Utkarsh\AppData\Local\Temp\ipykernel_19004\894755050.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  infosub['marks'][0]=100

In [113]:
infosub

     name  age      city  marks
0    John   23    London    100
1    Mary   78  New York     90
2   Peter   22    London     70
3    Jeff   19     Paris     50
4    Bill   45    London     87
5    Lisa   33  New York     79
6  Joseph   20    London     90

In [114]:
a=np.random.randint(1,100,10)
a

array([72, 68, 19, 63, 27, 11, 93, 46, 71, 61])

In [115]:
newdf=pd.DataFrame(np.random.randn(100,4), index=np.arange(1,101))

In [116]:
newdf

            0         1         2         3
1    2.042471 -0.400875  1.370323 -1.788766
2   -1.841775  0.576501  1.191858 -0.350347
3   -0.735304 -1.552828 -0.275801  1.185297
4   -0.653800 -2.355419  1.350730  1.198385
5    0.761004  0.584293 -0.141347 -0.298013
..        ...       ...       ...       ...
96  -1.061539 -0.132036  0.503117 -1.003085
97   0.230273 -0.255295 -1.134364 -0.823465
98  -0.028517 -1.632946 -1.415411 -0.870072
99  -0.140462  0.160461  0.921222  0.733350
100  1.653408  0.935863  0.505339  0.310249

[100 rows x 4 columns]

In [117]:
infosub['name'][0]='myname'

C:\Users\Utkarsh\AppData\Local\Temp\ipykernel_19004\114682953.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  infosub['name'][0]='myname'

In [118]:
infosub

     name  age      city  marks
0  myname   23    London    100
1    Mary   78  New York     90
2   Peter   22    London     70
3    Jeff   19     Paris     50
4    Bill   45    London     87
5    Lisa   33  New York     79
6  Joseph   20    London     90

In [119]:
infosub.index

RangeIndex(start=0, stop=7, step=1)

In [120]:
# infosub.loc['name',0]='anthony'
# infosub.loc['name',1]='aman'

In [121]:
infosub.loc[0,'name']='a'
infosub.loc[0,'age']='b'
infosub

     name age      city  marks
0       a   b    London    100
1    Mary  78  New York     90
2   Peter  22    London     70
3    Jeff  19     Paris     50
4    Bill  45    London     87
5    Lisa  33  New York     79
6  Joseph  20    London     90

In [123]:
infosub.drop('marks', axis=1)

     name age      city
0       a   b    London
1    Mary  78  New York
2   Peter  22    London
3    Jeff  19     Paris
4    Bill  45    London
5    Lisa  33  New York
6  Joseph  20    London

In [127]:
infosub.iloc[1:6][1:4]

    name age    city  marks
2  Peter  22  London     70
3   Jeff  19   Paris     50
4   Bill  45  London     87